// Функция, с помощью которой можно добавить сразу всю папку с фотографиями(или другими файлами с нужными нам расширениями)

function importAll(r) {
    return r.keys().map(r);
}

// ================================================================================================================
// Далее создаем константу с любым именем и передаем в нее функцию "importAll" и в этой функции указываем адрес папки с фотографиями.
// В итоге функция вернет массив[] с файлами(например фотографиями)

// const importIMG = importAll(require.context('../../assets/img/crazy_but_real', false, /\.(png|jpe?g|svg)$/))
// ================================================================================================================

export default importAll