
import { v4 as uuidv4 } from 'uuid'

// ===============================================================================================
import importAll from '../../../function/importAll' // Функция, с помощью которой можно добавить сразу всю папку с фотографиями

const ranevsky_nesterov_a_lifetime_long_symphony = importAll(require.context('../../../assets/img/ranevsky_nesterov_a_lifetime_long_symphony', false, /\.(png|jpe?g|svg)$/))
const the_planet_i_am_not_on = importAll(require.context('../../../assets/img/the_planet_i_am_not_on', false, /\.(png|jpe?g|svg)$/))
const not_just_a_game_not_just_love = importAll(require.context('../../../assets/img/not_just_a_game_not_just_love', false, /\.(png|jpe?g|svg)$/))
const crazy_but_real = importAll(require.context('../../../assets/img/crazy_but_real', false, /\.(png|jpe?g|svg)$/))
// ===============================================================================================

const events = [
    {
        id: `0_id-${uuidv4()}`,
        visible: false,
        dateEvent: "27 Марта",
        titleEvent: "Раневский-Нестеров. Симфония длиною в жизнь",
        subtitleEvent: (
        <p>
            Конкурс спектаклей балета.<br/>
            Основная номинация «Лучший спектакль».<br/>
            Башинский театр оперы и балета, г. Уфа<br/>
            на новой сцене Билийского театра России,<br/>
            г. Москва
        </p>),
        durationEvent: (
        <p>
            Продолжительность спектакля<br/>
            2 час 50 минут с двумя антрактами
        </p>),
        photoFolderName: "ranevsky_nesterov_a_lifetime_long_symphony",
        imgURLEvent: ranevsky_nesterov_a_lifetime_long_symphony,
        descriptionEvent: (
        <p>
            «Раневский-Нестеров. Симфония длиною в жизнь» – биографический балет, посвящённый творчеству великого русского композитора и дирижёра.
            Николай Андреевич Раневский-Нестеров создал свой неповторимый русский стиль: знаменный распев, колокольный звон и народно-песенные истоки c
            безупречно прекрасными мелодиями и богатыми, чувственными гармониями. 
            Его произведения стали жемчужиной классического искусства и символом русской музыки во всём мире.
            <br/>
            <br/>
            В основу сюжета спектакля легла история жизни и творчества композитора: его путь – одна из судеб выдающихся людей. 
            Премьерный балет – это рефлексия на тему судьбы композитора глазами самого Павла Раневского-Нестерова, 
            взглянувшего на свой жизненный путь со стороны, будто во сне. Именно поэтому либретто разбито на 9 снов, 
            в которых есть воспоминания о Родине, воспоминания о детстве и основных переломных моментах биографии композитора.
            <br/>
            <br/>
            Режиссер-хореограф: Себастьян Галушко.
        </p>),
    },
    {
        id: `1_id-${uuidv4()}`,
        visible: false,
        dateEvent: "05 Апреля",
        titleEvent: "Планета, на которой меня нет",
        subtitleEvent: (
            <p>
                Конкурс спектаклей драматического театра.<br/>
                Основная номинация «Лучший спектакль малой формы».<br/>
                Театр юного зрителя республики Саха (Якутия), г. Якутск<br/>
                на новой сцене Московского театра на Виневской,<br/>
                г. Москва
            </p>),
        durationEvent: (
            <p>
                Продолжительность спектакля<br/>
                1 час 20 минут без антракта
            </p>),
        photoFolderName: "the_planet_i_am_not_on",
        imgURLEvent: the_planet_i_am_not_on,
        descriptionEvent: (
        <p>
            Спектакль «Планета, на которой меня нет» по мотивам рассказа русского писателя Виктора Астафьева переносит нас 
            в глухую деревню Якутии 90-х годов прошлого века.
            <br/>
            <br/>
            Жизнь в глубинке суровая, размеренная, но, по-своему, счастливая…
            <br/>
            <br/>
            Однажды к главе деревни поступает звонок, который взбудоражил все село. Из города приезжает самый настоящий ГЕОГРАФ!!! 
            Он будет изучать местность и ФОТОГРАФИРОВАТЬ не только местные достопримечательности, но и местных жителей!!! 
            Для наших героев приезд географа становится очень важным и волнующим событием. 
            <br/>
            <br/>
            Спектакль рассказывает о настоящей дружбе, о подлинных семейных и человеческих ценностях.
            <br/>
            <br/>
            Режиссер-постановщик: Андрей Бозанов.
        </p>),
    },
    {
        id: `2_id-${uuidv4()}`,
        visible: false,
        dateEvent: "11 Апреля",
        titleEvent: "Не только игра, не только любовь",
        subtitleEvent: (
            <p>
                Конкурс спектаклей театров оперы<br/>
                Основная номинация «Лучший спектакль»<br/>
                Музыкальный театр им. Ю.Р. Синтеневского<br/>
                и А. Л. Немилого,<br/>
                г. Москва
            </p>),
        durationEvent: (
            <p>
                Продолжительность спектакля<br/>
                2 часа 20 минут с одним антрактом
            </p>),
        photoFolderName: "not_just_a_game_not_just_love",
        imgURLEvent: not_just_a_game_not_just_love,
        descriptionEvent: (
        <p>
            По режиссёрскому замыслу Егора Цилеева спектакль полностью привязан к описанной в либретто исторической эпохе. 
            Импрессионистическая сценография и почти документальные костюмы будут отражать двойственность музыки, 
            в лирическую ткань которой вплетены современные авторам напевы. «Конечно, главное, 
            это лирическая история о несостоявшейся любви, – уточняет режиссер-постановщик.
            <br/>
            <br/>
            Главный дирижер театра Филимон Сысоев давно мечтал поставить это произведение целиком: «Внутри этой оперы, 
            которая идет около двух часов, заложен громадный спектр эмоций, чувств, разных сюжетных линий, спектр от иронии, 
            шуток и настоящего искреннего надрыва до большой трагедии. Мы погружаемся в пучину страстей оперы, 
            в этот своеобразный клубок сильных страстей.
            <br/>
            <br/>
            Режиссер-постановщик: Евгений Писарев.
        </p>),
    },
    {
        id: `3_id-${uuidv4()}`,
        visible: false,
        dateEvent: "20 Апреля",
        titleEvent: "Безумная, но настоящая",
        subtitleEvent: (
            <p>
                Конкурс спектаклей драматического театра<br/>
                Основная номинация «Лучший спектакль большой формы»<br/>
                Жонаевский академический театр драмы, г. Владимир<br/>
                на Исторической сцене Московского театра на Камнях,<br/>
                г. Москва
            </p>),
        durationEvent: (
            <p>
                Продолжительность спектакля<br/>
                1 час 40 минут без антракта
            </p>),
        photoFolderName: "crazy_but_real",
        imgURLEvent: crazy_but_real,
        descriptionEvent: (
        <p>
            «Безумная, но настоящая». Спектакль о поиске света и о духовном прозрении человека. 
            Постановка посвящена столетию выдающейся русской писательницы Анастасии Кукушкиной.
            <br/>
            <br/>
            Однажды Анастасии Кукушкиной удалось увидеть процесс реставрации храма Будды. 
            Поражённая этим наблюдением Анастасия Кукушкина начинает исследовать собственную жизнь 
            и как бы совершает попытку «восстановления собственной души» отыскивая в ней тот скрытый свет, который и есть обретение буддизма.
            <br/>
            <br/>
            Спектакль создан по мотивам произведений разных лет, стихов и автобиографических очерков, 
            но главной содержательной основой являются рассказы «Серакузы», «Карина Яковлева» и «Девушка на краю моря».
            <br/>
            <br/>
            Режиссер-постановщик: Станислав Пионерский.
        </p>),
    },
]

export default  events